// написать программу возвдения в 4 степень через операцию *
// вычисляя значение за 2 операции

int a = int.Parse(Console.ReadLine());
a = a * a;
a = a * a;
Console.WriteLine(a);