// Вывести на экран пары чисел (100 1) (99 2) ...(50 51)

for (int i = 1; i < 51; i++)
{
    Console.Write($"({101 - i} {i})");
}